{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9df40aba",
   "metadata": {},
   "outputs": [],
   "source": [
    "# neo4j_for_adk is a helper module for using Neo4j with Google's Agent Development Kit\n",
    "from neo4j_for_adk import graphdb\n",
    "\n",
    "# these two helpers are useful for resetting the database\n",
    "from tools import drop_neo4j_indexes, clear_neo4j_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "51885fa8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'status': 'success', 'query_result': [{'message': 'Neo4j is Ready!'}]}\n"
     ]
    }
   ],
   "source": [
    "# Check that Neo4j is ready by sending a simple query that returns a string\n",
    "neo4j_is_ready = graphdb.send_query(\"RETURN 'Neo4j is Ready!' as message\")\n",
    "\n",
    "print(neo4j_is_ready)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "554ef392",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'status': 'success', 'query_result': [{'name': 'genai.vector.encodeBatch', 'description': \"Encode a given batch of resources as vectors using the named provider.\\nFor each element in the given resource LIST this returns:\\n    * the corresponding 'index' within that LIST,\\n    * the original 'resource' element itself,\\n    * and the encoded 'vector'.\\n\", 'mode': 'DEFAULT', 'worksOnSystem': False}, {'name': 'genai.vector.listEncodingProviders', 'description': 'Lists the available vector embedding providers.', 'mode': 'DEFAULT', 'worksOnSystem': False}]}\n",
      "{'status': 'success', 'query_result': [{'name': 'apoc.text.phoneticDelta', 'description': 'Returns the US_ENGLISH soundex character difference between the two given `STRING` values.', 'mode': 'DEFAULT', 'worksOnSystem': False}]}\n"
     ]
    }
   ],
   "source": [
    "# Check that the expected genai and apoc procedures are available\n",
    "\n",
    "genai_procedures = graphdb.send_query(\"SHOW PROCEDURES WHERE name CONTAINS 'genai.vector'\")\n",
    "\n",
    "print(genai_procedures)\n",
    "\n",
    "apoc_text_procedures = graphdb.send_query(\"SHOW PROCEDURES WHERE name CONTAINS 'apoc.text'\")\n",
    "\n",
    "print(apoc_text_procedures)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "1a26cda5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'status': 'success',\n",
       " 'message': 'Neo4j constraints and indexes have been dropped.'}"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "drop_neo4j_indexes()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "e5396404",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'status': 'success', 'message': 'Neo4j graph has been reset.'}"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "clear_neo4j_data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "f2bbc0ad",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of nodes: 0\n"
     ]
    }
   ],
   "source": [
    "neo4j_stats = graphdb.send_query(\"MATCH (n) RETURN count(n) as node_count\")\n",
    "\n",
    "print(f\"Number of nodes: {neo4j_stats['query_result'][0]['node_count']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "32755e86",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
